app/controllers/cash_books_controller.rb

  def index
    @cash_books = CashBook.find_all_by_owner_id(current_user)
---
SELECT * FROM "cash_books" WHERE ("cash_books"."owner_id" = 1)

  def show
    @cash_book = CashBook.find(params[:id])
    session[:cash_book_id] = params[:id]
    @last_entries = Entry.find_all_by_cash_book_id(@cash_book, :limit  => 5, :order => 'id desc')
---
SELECT * FROM "cash_books" WHERE ("cash_books"."id" = 1)
SELECT * FROM "entries" WHERE ("entries"."cash_book_id" = 1) ORDER BY id desc LIMIT 5