app/controllers/entries_controller.rb

SELECT * FROM "entries" WHERE ("entries"."id" = 3)
---
  def show
    @entry = Entry.find(params[:id])